benchmark.redproxy.txt
====== PING_INLINE ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

81.00% <= 1 milliseconds
100.00% <= 1 milliseconds
11111.11 requests per second

====== PING_BULK ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

88.00% <= 1 milliseconds
91.00% <= 2 milliseconds
95.00% <= 3 milliseconds
99.00% <= 4 milliseconds
100.00% <= 4 milliseconds
11111.11 requests per second

====== SET ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

86.00% <= 1 milliseconds
97.00% <= 2 milliseconds
100.00% <= 2 milliseconds
11111.11 requests per second

====== GET ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

33.00% <= 1 milliseconds
92.00% <= 2 milliseconds
98.00% <= 3 milliseconds
99.00% <= 4 milliseconds
100.00% <= 4 milliseconds
7142.86 requests per second

====== INCR ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

66.00% <= 1 milliseconds
93.00% <= 2 milliseconds
100.00% <= 2 milliseconds
9090.91 requests per second

====== LPUSH ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

72.00% <= 1 milliseconds
99.00% <= 2 milliseconds
100.00% <= 2 milliseconds
10000.00 requests per second

====== LPOP ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

88.00% <= 1 milliseconds
97.00% <= 2 milliseconds
100.00% <= 2 milliseconds
11111.11 requests per second

====== SADD ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

71.00% <= 1 milliseconds
97.00% <= 2 milliseconds
100.00% <= 2 milliseconds
10000.00 requests per second

====== SPOP ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.00% <= 1 milliseconds
95.00% <= 2 milliseconds
99.00% <= 3 milliseconds
100.00% <= 3 milliseconds
10000.00 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100 requests completed in 0.01 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

85.00% <= 1 milliseconds
99.00% <= 2 milliseconds
100.00% <= 2 milliseconds
11111.11 requests per second

====== LRANGE_100 (first 100 elements) ======
  100 requests completed in 0.05 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

2.00% <= 1 milliseconds
5.00% <= 2 milliseconds
12.00% <= 3 milliseconds
55.00% <= 4 milliseconds
66.00% <= 5 milliseconds
89.00% <= 6 milliseconds
97.00% <= 7 milliseconds
100.00% <= 12 milliseconds
2127.66 requests per second

====== LRANGE_300 (first 300 elements) ======
  100 requests completed in 0.13 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 2 milliseconds
2.00% <= 3 milliseconds
3.00% <= 4 milliseconds
4.00% <= 5 milliseconds
7.00% <= 6 milliseconds
8.00% <= 8 milliseconds
10.00% <= 9 milliseconds
11.00% <= 10 milliseconds
14.00% <= 11 milliseconds
35.00% <= 12 milliseconds
47.00% <= 13 milliseconds
89.00% <= 14 milliseconds
96.00% <= 15 milliseconds
98.00% <= 19 milliseconds
100.00% <= 25 milliseconds
757.58 requests per second

====== LRANGE_500 (first 450 elements) ======
  100 requests completed in 0.20 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 2 milliseconds
2.00% <= 4 milliseconds
3.00% <= 5 milliseconds
4.00% <= 7 milliseconds
5.00% <= 8 milliseconds
6.00% <= 9 milliseconds
7.00% <= 12 milliseconds
11.00% <= 14 milliseconds
12.00% <= 15 milliseconds
14.00% <= 16 milliseconds
20.00% <= 17 milliseconds
26.00% <= 18 milliseconds
44.00% <= 19 milliseconds
88.00% <= 20 milliseconds
92.00% <= 21 milliseconds
96.00% <= 22 milliseconds
98.00% <= 24 milliseconds
99.00% <= 36 milliseconds
100.00% <= 38 milliseconds
510.20 requests per second

====== LRANGE_600 (first 600 elements) ======
  100 requests completed in 0.26 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 3 milliseconds
2.00% <= 5 milliseconds
3.00% <= 7 milliseconds
4.00% <= 10 milliseconds
5.00% <= 11 milliseconds
6.00% <= 12 milliseconds
7.00% <= 13 milliseconds
8.00% <= 14 milliseconds
10.00% <= 19 milliseconds
12.00% <= 20 milliseconds
14.00% <= 21 milliseconds
18.00% <= 22 milliseconds
42.00% <= 23 milliseconds
62.00% <= 24 milliseconds
80.00% <= 25 milliseconds
91.00% <= 26 milliseconds
94.00% <= 27 milliseconds
95.00% <= 28 milliseconds
97.00% <= 29 milliseconds
98.00% <= 35 milliseconds
99.00% <= 37 milliseconds
100.00% <= 52 milliseconds
386.10 requests per second

====== MSET (10 keys) ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

11.00% <= 1 milliseconds
84.00% <= 2 milliseconds
89.00% <= 3 milliseconds
99.00% <= 4 milliseconds
100.00% <= 4 milliseconds
5882.35 requests per second