benchmark.redproxy.txt
====== PING (inline) ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 1 milliseconds
75.00% <= 2 milliseconds
99.00% <= 3 milliseconds
100.00% <= 3 milliseconds
5000.00 requests per second

====== PING ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

4.00% <= 1 milliseconds
79.00% <= 2 milliseconds
100.00% <= 2 milliseconds
5263.16 requests per second

====== MSET (10 keys) ======
  100 requests completed in 0.10 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 3 milliseconds
2.00% <= 4 milliseconds
3.00% <= 5 milliseconds
4.00% <= 6 milliseconds
5.00% <= 7 milliseconds
6.00% <= 8 milliseconds
7.00% <= 9 milliseconds
47.00% <= 10 milliseconds
92.00% <= 11 milliseconds
99.00% <= 12 milliseconds
100.00% <= 14 milliseconds
952.38 requests per second

====== SET ======
  100 requests completed in 0.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

3.00% <= 1 milliseconds
7.00% <= 2 milliseconds
91.00% <= 3 milliseconds
100.00% <= 3 milliseconds
3703.70 requests per second

====== GET ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

3.00% <= 1 milliseconds
6.00% <= 2 milliseconds
100.00% <= 2 milliseconds
4166.67 requests per second

====== INCR ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

3.00% <= 1 milliseconds
8.00% <= 2 milliseconds
100.00% <= 2 milliseconds
4166.67 requests per second

====== LPUSH ======
  100 requests completed in 0.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

2.00% <= 1 milliseconds
7.00% <= 2 milliseconds
91.00% <= 3 milliseconds
100.00% <= 3 milliseconds
3571.43 requests per second

====== LPOP ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

3.00% <= 1 milliseconds
7.00% <= 2 milliseconds
100.00% <= 2 milliseconds
4166.67 requests per second

====== SADD ======
  100 requests completed in 0.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

3.00% <= 1 milliseconds
7.00% <= 2 milliseconds
96.00% <= 3 milliseconds
100.00% <= 3 milliseconds
3703.70 requests per second

====== SPOP ======
  100 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

4.00% <= 1 milliseconds
14.00% <= 2 milliseconds
98.00% <= 3 milliseconds
100.00% <= 3 milliseconds
4166.67 requests per second

====== LPUSH (again, in order to bench LRANGE) ======
  100 requests completed in 0.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 1 milliseconds
5.00% <= 2 milliseconds
90.00% <= 3 milliseconds
100.00% <= 3 milliseconds
3571.43 requests per second

====== LRANGE (first 100 elements) ======
  100 requests completed in 0.43 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 1 milliseconds
2.00% <= 2 milliseconds
3.00% <= 9 milliseconds
4.00% <= 14 milliseconds
5.00% <= 16 milliseconds
6.00% <= 22 milliseconds
7.00% <= 26 milliseconds
8.00% <= 29 milliseconds
9.00% <= 32 milliseconds
10.00% <= 33 milliseconds
11.00% <= 34 milliseconds
16.00% <= 35 milliseconds
25.00% <= 36 milliseconds
37.00% <= 37 milliseconds
52.00% <= 38 milliseconds
76.00% <= 39 milliseconds
87.00% <= 40 milliseconds
96.00% <= 41 milliseconds
100.00% <= 44 milliseconds
234.74 requests per second

====== LRANGE (first 300 elements) ======
  100 requests completed in 1.21 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 2 milliseconds
2.00% <= 8 milliseconds
3.00% <= 27 milliseconds
4.00% <= 39 milliseconds
5.00% <= 52 milliseconds
6.00% <= 54 milliseconds
7.00% <= 70 milliseconds
8.00% <= 89 milliseconds
9.00% <= 90 milliseconds
10.00% <= 91 milliseconds
11.00% <= 94 milliseconds
12.00% <= 95 milliseconds
13.00% <= 96 milliseconds
14.00% <= 97 milliseconds
15.00% <= 100 milliseconds
18.00% <= 101 milliseconds
20.00% <= 102 milliseconds
22.00% <= 103 milliseconds
25.00% <= 104 milliseconds
28.00% <= 105 milliseconds
32.00% <= 106 milliseconds
40.00% <= 107 milliseconds
44.00% <= 108 milliseconds
54.00% <= 109 milliseconds
61.00% <= 110 milliseconds
68.00% <= 111 milliseconds
78.00% <= 112 milliseconds
87.00% <= 113 milliseconds
95.00% <= 114 milliseconds
100.00% <= 115 milliseconds
82.44 requests per second

====== LRANGE (first 450 elements) ======
  100 requests completed in 1.82 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 2 milliseconds
2.00% <= 6 milliseconds
3.00% <= 28 milliseconds
4.00% <= 56 milliseconds
5.00% <= 72 milliseconds
6.00% <= 91 milliseconds
7.00% <= 110 milliseconds
8.00% <= 127 milliseconds
9.00% <= 144 milliseconds
10.00% <= 146 milliseconds
11.00% <= 148 milliseconds
12.00% <= 150 milliseconds
13.00% <= 152 milliseconds
14.00% <= 153 milliseconds
15.00% <= 154 milliseconds
18.00% <= 155 milliseconds
20.00% <= 156 milliseconds
25.00% <= 157 milliseconds
30.00% <= 158 milliseconds
32.00% <= 159 milliseconds
37.00% <= 160 milliseconds
49.00% <= 161 milliseconds
59.00% <= 162 milliseconds
63.00% <= 163 milliseconds
71.00% <= 164 milliseconds
74.00% <= 165 milliseconds
80.00% <= 166 milliseconds
83.00% <= 168 milliseconds
86.00% <= 169 milliseconds
87.00% <= 170 milliseconds
88.00% <= 171 milliseconds
89.00% <= 172 milliseconds
90.00% <= 173 milliseconds
93.00% <= 174 milliseconds
96.00% <= 175 milliseconds
97.00% <= 176 milliseconds
100.00% <= 177 milliseconds
55.10 requests per second

====== LRANGE (first 600 elements) ======
  100 requests completed in 2.44 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

1.00% <= 3 milliseconds
2.00% <= 9 milliseconds
3.00% <= 43 milliseconds
4.00% <= 74 milliseconds
5.00% <= 81 milliseconds
6.00% <= 104 milliseconds
7.00% <= 143 milliseconds
8.00% <= 167 milliseconds
9.00% <= 191 milliseconds
10.00% <= 195 milliseconds
11.00% <= 199 milliseconds
12.00% <= 208 milliseconds
13.00% <= 211 milliseconds
16.00% <= 212 milliseconds
17.00% <= 213 milliseconds
20.00% <= 214 milliseconds
22.00% <= 215 milliseconds
24.00% <= 216 milliseconds
29.00% <= 217 milliseconds
34.00% <= 218 milliseconds
37.00% <= 219 milliseconds
47.00% <= 220 milliseconds
56.00% <= 221 milliseconds
67.00% <= 222 milliseconds
73.00% <= 223 milliseconds
75.00% <= 224 milliseconds
78.00% <= 225 milliseconds
83.00% <= 226 milliseconds
85.00% <= 227 milliseconds
89.00% <= 228 milliseconds
91.00% <= 229 milliseconds
94.00% <= 230 milliseconds
96.00% <= 231 milliseconds
100.00% <= 232 milliseconds
40.97 requests per second